console.log('number' + 3 + 3);
// Результат number33. До рядка "number" додається "3" в якості рядка два рази
console.log(null + 3);
// Результат 3. null конвертується в 0, тому 0 + 3 = 3
console.log(5 && "qwerty");
/* Результат qwerty. Оператор && повертає перше значення, якщо воно false, 
інакше повертає друге значення. 5 не = false, тому результат "qwerty" */
console.log(+'40' + +'2' + "hillel");
// Результат 42hillel. Спочатку відбудеться додавання чисел (40+2=42), потім числа додадуться рядком до "hillel"
console.log('10' - 5 === 6);
// Результат false. 10 перетворється в число, 10 - 5 = 5, 5 === 6, прирівнювання де 5 не = 6, тому поверенться false
console.log(true + false);
// Результат 1. true = 1 а false = 0, 1 + 0 = 1
console.log('4px' - 3);
// Результат NaN. 4px не можна перетворити на число, тому кінцевий варіант буде NaN
console.log('4' - 3);
// Результат 1. 4 перетвориться в число, 4 - 3 = 1
console.log('6' + 3 ** 0);
// Результат 61. 3 ** 0 = 1, 6 як рядок, до рядка додаємо 1 як рядок, отримуємо "61" як рядок
console.log(12 / '6');
// Результат 2. 6 перетвориться в число, 12 / 6 = 2
console.log('10' + (5 === 6));
// Результат 10false. 5 не дорівнює 6, тому там буде false. рядок "10" + "false" = "10false"
console.log(null == '');
// Результат false. null ен дорівнює порожньому рядку
console.log(3 ** (9 / 3));
// Результат 27. Спочатку 9 / 3 = 3. Потім 3 в 3 степені = 27
console.log(!!'false' == !!'true');
/* Результат true. Спочатку рядки перетворюються в булеві. Потім вудбувається двічі негативація.
Тобто !!'false' стає true, оскільки false перетворюється в true, 
а !!'true' також стає true, оскільки true перетворюється в true. 
В кінцевому результаті true = true, що дорівнює true */
console.log(0 || '0' && 1);
/* Результат 1. Оператор && має вищий пріоритет, ніж ||, 
тому ми спочатку обробляємо '0' && 1, отримаємо 1, а потім 0 || 1, що дорівнює 1 */
console.log((+null == false) < 1);
// Результат false. null конвертується в 0. 0 == false, що в свою чергу поверне true, а true це 1. 1 < 1 = false
console.log(false && true || true);
// Результат true. false && true поверне false. а false || true поверне true
console.log(false && (false || true));
// Результат false. Спочатку в дужках - false || true поверне true. а false && true поверне false
console.log((+null == false) < 1 ** 5);
/* Результат false. Спочатку в дужках - null = 0, false = 0, 0 == 0 що поверне true (а це 1)
1 ** 5 = 1. В кінцевому розрахунку 1 < 1 поверне false */